app/Controllers/QuizList.php

INSERT INTO `modules` (`mname`) VALUES ('Java')
---
  public function saveQuiz()
  {
    $json = file_get_contents('php://input');
    $data = json_decode($json, true);

    $model = new QuizListModel();
    if (is_numeric($data['moduleid'])) {
      $st = $model->update($data['moduleid'], $data);
    } else {
      if ($model->insert($data, false)) {